Мюнцкабинент_30/src/InformationRegisters/ПочтовыеИдентификаторы/ПочтовыеИдентификаторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеИдентификаторы</name>
  <comment>Почтовые идентификаторы для отслеживания отправлений</comment>
  <resources>
    <name>ТипИдентификатора</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <resources>
    <name>ПочтовыйИдентификатор</name>
    <type>
      <types>Characteristic.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <attributes>
    <name>ВрученАдресату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийСтатус</name>
    <comment>Для контроля изменения статуса</comment>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОтслеживаемыеПочтовыеОтправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/ПочтовыеИдентификаторы/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.ТипИдентификатора) Тогда // новый
		Если ПустаяСтрока(Запись.ПочтовыйИдентификатор) ИЛИ СтрДлина(Запись.ПочтовыйИдентификатор) = 14 Тогда
			Запись.ТипИдентификатора = ПланыВидовХарактеристик.ВидыПочтовыхИдентификаторов.ПочтаРФ;
		КонецЕсли;	
	КонецЕсли;

	ЭтаФорма.ТолькоПросмотр = Запись.ВрученАдресату;
	
КонецПроцедуры
